SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/9CE84Y0Y9Q/PassengerDetailsRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">PassengerDetailsRQ</eb:Service>       <eb:Action>PassengerDetailsRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Travel Itinerary Info Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1536504770271!5929946!196609</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <PassengerDetailsRQ  xmlns="http://services.sabre.com/sp/pd/v3_3" version="3.3.0" IgnoreOnError="false" HaltOnError="false">       <PostProcessing IgnoreAfter="false" RedisplayReservation="true" UnmaskCreditCard="true"/> <PriceQuoteInfo> <Link NameNumber="1.1" Record="1"/></PriceQuoteInfo>        <SpecialReqDetails>           <AddRemarkRQ>               <RemarkInfo>                   <Remark Code="H" SegmentNumber="1" Type="General">                       <Text>CVV 254-Manpreet sekhon-45874  Delhi  DL  India  74581-CCFee 0.00</Text>                   </Remark>               </RemarkInfo>           </AddRemarkRQ>          <SpecialServiceRQ><SpecialServiceInfo><SecureFlight  SegmentNumber="A">   <PersonName DateOfBirth="1988-09-05" Gender="M" NameNumber="1.1" >        <GivenName>MANPREET KAUR  MR</GivenName>        <Surname>SEKHON</Surname>   </PersonName></SecureFlight></SpecialServiceInfo>          </SpecialServiceRQ>     </SpecialReqDetails>    <TravelItineraryAddInfoRQ>       <AgencyInfo>          <Address>               <AddressLine>SkyFlight Travel Center</AddressLine>               <CityName></CityName>               <CountryCode></CountryCode>               <PostalCode>L6Y 1N7</PostalCode>               <StateCountyProv StateCode=""/>               <StreetNmbr>Suite 209-499 Main Street South</StreetNmbr>          </Address>          <Ticketing  TicketType="7TAW" PseudoCityCode="6DTH" QueueNumber="55" ShortText="ABD"/>       </AgencyInfo>       <CustomerInfo><ContactNumbers><ContactNumber  NameNumber="1.1" Phone="9875496548" PhoneUseType="H"/><ContactNumber PhoneUseType="A" Phone="18773897388" /></ContactNumbers><Email Address="khushdeepb@nanojot.com" NameNumber="1.1" /><Email Address="reservations@skyflight.ca" />          <PersonName Infant="false" NameNumber="1.1"   PassengerType ="ADT">               <GivenName>MANPREET KAUR  MR</GivenName>               <Surname>SEKHON</Surname>          </PersonName>       </CustomerInfo>    </TravelItineraryAddInfoRQ>    </PassengerDetailsRQ></soapenv:Body></soapenv:Envelope>